src zup/cf/Catalogs/ВидыПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыПодключений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src zup/cf/Catalogs/ВидыПодключений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	ДанныеПодключения = Новый Структура();
	ДанныеПодключения.Вставить("Адрес",Объект.Адрес);
	ДанныеПодключения.Вставить("ВиртуальныйХост",Объект.ВиртуальныйХост);
	ДанныеПодключения.Вставить("КлючМаршрутизации",Объект.КлючМаршрутизации);
	ДанныеПодключения.Вставить("ИмяОчереди",Объект.ИмяОчереди);
	ДанныеПодключения.Вставить("Логин",Объект.Логин);
	ДанныеПодключения.Вставить("Пароль",Объект.Пароль); 
	ДанныеПодключения.Вставить("Порт",Объект.Порт);
    ДанныеПодключения.Вставить("ТочкаОбмена",Объект.ТочкаОбмена);

	Успешно = РаботаСRMQ.ПодключитьИПроверитьПодключение(ДанныеПодключения);
	
	Если Успешно Тогда
		Сообщить("Компонента подключена");
	Иначе
		Сообщить("Ошибка подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры
